// 1. Описать класс для работы с бинарным деревом  
// 1.1 Реализовать три варианта обхода - ru.wikipedia.org/wiki/Обход_дерева#Прямой_обход_(NLR)
// 1.2 Сделать скобочную запись бинарного дерева

// *2. Реализовать структуру данных "Очередь" на основе массива
// 2.1 Нужно сделать операцию "Добавить в очередь"
// 2.2 Нужно сделать операцию "Извлечь из очереди"

package HomeWork6;

public class HomeWork6 {
    public static void main(String[] args) {
        int[] mas = new int[] {1, 50, 20, 6, 8, 10, 59, 11};
    }
}
