// Написать программу вычисления n-ого треугольного числа.

package HomeWork2;
import java.util.Scanner;

public class HomeWork2 {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in)
        System.out.println("Введите число ");
    }

}
